trade_exp/src/DataProcessors/ПроверкаАдресногоХранения/ПроверкаАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаАдресногоХранения</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяЯчейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелеваяЯчейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияПриПроверкеАдресногоХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>НетЭтикетки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/Enums/ДействияПриПроверкеАдресногоХранения/ДействияПриПроверкеАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cc11fa7c-d2a9-4c13-9d56-a6f77444d68b">
  <name>ДействияПриПроверкеАдресногоХранения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6e205829-0d0c-48c7-9bed-49712f48d941">
    <name>ПереложитьВДругуюЯчейку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="75107e97-c012-4e72-8310-683457edd446">
    <name>ПрисвоитьТекущуюЯчейку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af13aadd-1ff3-4ca9-ad06-5b916348a725">
    <name>СделатьЯчейкуДополнительной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="066e30f6-7b05-4707-b88c-048e47e0ee62">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f3e5dfce-ce94-489f-bbc6-ba1b699e6a56">
    <name>ИспользованиеПериодичностиИнвентаризацииЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7afe322-1954-42ee-b9f7-20803df9f4db">
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="942b70ab-8729-495e-aa2e-e362fab7ecfd">
    <name>ТипСкладскойЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c08d78e7-8199-4896-a9fc-9ac0cb946bff">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60091b4d-b59a-402b-8b0a-8f53fca6515a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56a97705-349f-4913-8e45-02a642ba3195">
    <name>ПорядокОбхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc923ed7-93a9-4ab2-80bf-95d378dac70c">
    <name>Позиция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82b6a5ac-4bdb-4046-b405-1382915a4c74">
    <name>УровеньДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4a34412-3576-4048-b17b-40befc421c3f">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61217d52-e955-4b33-bc99-11d43aa1c1d9">
    <name>ОбластьХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63793c84-fe0a-46a7-b089-23086db66ef4">
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45830319-bd9f-49d6-afc3-425511de0559">
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПроверкаАдресногоХранения/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Объект.Сотрудник = Альтерра_СкладСервер.ТекущийСотрудник();
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.Склад = Объект.Сотрудник.Склад;
	КонецЕсли;

	Режим = "ПроверкаАХ";
	УстановитьВидимостьПриРежиме(Режим, "Проверка адресного хранения");
	
	ДействиеПрисвоитьТекущуюЯчейку = Перечисления.ДействияПриПроверкеАдресногоХранения.ПрисвоитьТекущуюЯчейку;	
	ДействиеПереложитьВДругуюЯчейку = Перечисления.ДействияПриПроверкеАдресногоХранения.ПереложитьВДругуюЯчейку;
	ДействиеСделатьЯчейкуДополнительной = Перечисления.ДействияПриПроверкеАдресногоХранения.СделатьЯчейкуДополнительной;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда
		
		Если Не ПодтвержденоЗакрытиеФормы Тогда 
			Отказ = Истина;
	    	ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Завершить работу по проверке адресного хранения?", РежимДиалогаВопрос.ДаНет, 10 ,КодВозвратаДиалога.Нет);		
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПодтвержденоЗакрытиеФормы = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьНоменклатуру(Команда)
	Если ЗначениеЗаполнено(Объект.Склад) И  ЗначениеЗаполнено(Объект.Ячейка) Тогда
		
		Если Объект.Товары.Количество() = 0 Тогда
			ЗаполнитьНоменклатуруНаСервере();
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНоменклатуруЗавершение", ЭтотОбъект), "Список товаров будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщить("Не выбран склад");
	Иначе
		Сообщить("Не выбрана ячейка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимПроверкаАХ(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Режим", "ПроверкаАХ");
		ДополнительныеПараметры.Вставить("Заголовок", "Проверка адресного хранения");
		ПоказатьВопрос(Новый ОписаниеОповещения("СменитьРежимЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		Режим = "ПроверкаАХ";
		УстановитьВидимостьПриРежиме(Режим, "Проверка адресного хранения")
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимНовыйСклад(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Режим", "НовыйСклад");
		ДополнительныеПараметры.Вставить("Заголовок", "Адресное хранение: Новый склад");
		ПоказатьВопрос(Новый ОписаниеОповещения("СменитьРежимЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	Иначе
		Режим = "НовыйСклад";
		УстановитьВидимостьПриРежиме(Режим, "Адресное хранение: Новый склад")
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВРегистр(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписьВРегистрЗавершение", ЭтотОбъект), "Записать новые данные о хранении товара?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область ИзмененияРежимаРаботы

&НаКлиенте
Процедура СменитьРежимЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Режим = ДополнительныеПараметры.Режим;
		УстановитьВидимостьПриРежиме(ДополнительныеПараметры.Режим, ДополнительныеПараметры.Заголовок);
		Объект.Товары.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьВидимостьПриРежиме(Режим, Заголовок)
	РежимПроверки = (Режим = "ПроверкаАХ");
	ЭтаФорма.Заголовок = Заголовок;
	ЭтаФорма.Элементы.ЗаполнитьНоменклатуру.Видимость = РежимПроверки;	
	ЭтаФорма.Элементы.ТоварыПроверено.Видимость = РежимПроверки;	
	ЭтаФорма.Элементы.ТоварыДействие.Видимость = РежимПроверки;
	ЭтаФорма.Элементы.ТоварыИсходнаяЯчейка.Видимость = РежимПроверки;
	ЭтаФорма.Элементы.ТоварыЦелеваяЯчейка.Видимость = РежимПроверки;
	ЭтаФорма.Элементы.ТоварыНетЭтикетки.Видимость = РежимПроверки;
КонецПроцедуры	

#КонецОбласти

#Область ВыбораСкладаИЯчейки

&НаКлиенте
Процедура СкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.Товары.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Объект.Склад) И ВыбранноеЗначение <> Объект.Склад Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Склад", ВыбранноеЗначение);
			ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьТоварыПриВыбореСкладаЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров не относится к выбираемому складу "  + ВыбранноеЗначение + Символы.ПС + "и будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			Объект.Склад = ВыбранноеЗначение;
		КонецЕсли
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТоварыПриВыбореСкладаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Склад = ДополнительныеПараметры.Склад;
		Объект.Товары.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРабочиеУчасткиНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ПолучитьСписокРабочихУчастковСотрудника(Объект.Сотрудник);
КонецФункции

&НаКлиенте
Процедура ВыбратьЯчейку(Элемент)
    ЗначениеОтбора = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		ЗначениеОтбора.Вставить("Владелец", Объект.Склад);
	КонецЕсли;
    ЗначениеОтбора.Вставить("ЭтоГруппа", Ложь);
    ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
	
    ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);	
	
	Форма = ПолучитьФорму("Справочник.СкладскиеЯчейки.ФормаВыбора", ПараметрыВыбора, Элемент);
	Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
	Форма.Элементы.Наименование.Видимость = Ложь;
	Форма.Элементы.ОбластьХранения.Видимость = Ложь;
	Форма.Элементы.Помещение.Видимость = Ложь;
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьЯчейку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.Товары.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(Объект.Ячейка) И ВыбранноеЗначение <> Объект.Ячейка Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Ячейка", ВыбранноеЗначение);
			ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьТоварыПриВыбореЯчейкиЗавершение", ЭтотОбъект, ДополнительныеПараметры), "Список товаров не относится к выбираемой ячейке "  + ВыбранноеЗначение + Символы.ПС + "и будет очищен. Продолжить", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			Объект.Ячейка = ВыбранноеЗначение;
		КонецЕсли
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТоварыПриВыбореЯчейкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Ячейка = ДополнительныеПараметры.Ячейка;
		Объект.Товары.Очистить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ЗаписиВРегистр

&НаСервере
Функция ЗаписатьВРегистрНаСервере()

	ТекстСообщения = "";
	ПолеСообщения = "";
		
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Результат = ДокументОбъект.ЗаписатьРезультатыПроверкиАХ(ТекстСообщения, ПолеСообщения);
	Если ПолеСообщения = "" Тогда
		Сообщить(ТекстСообщения)
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = ПолеСообщения;
		Сообщение.Сообщить();		
	КонецЕсли;	

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаписьВРегистрЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = ЗаписатьВРегистрНаСервере();
		
		Если Режим = "ПроверкаАХ" Тогда
			ТекстВопроса = "Получить обновленный список товаров в ячейке?"
		Иначе
			ТекстВопроса = "Очистить список товаров?"
		КонецЕсли;
		
		Если Результат Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьПослеЗаписиВРегистрЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПослеЗаписиВРегистрЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	Если Режим = "ПроверкаАХ" Тогда
		ЗаполнитьНоменклатуруНаСервере()
	Иначе
		Объект.Товары.Очистить();
	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ТабличнаяЧастьТовары

&НаСервере
Процедура ЗаполнитьНоменклатуруНаСервере()
	Объект.Товары.Очистить();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	СписокНоменклатуры = ДокументОбъект.ПолучитьНоменклатуруИзЯчейки(Объект.Склад, Объект.Ячейка, ТекущаяДата());
	
	Если СписокНоменклатуры.Количество() > 0 Тогда
		Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
			НовыйТовар = Объект.Товары.Добавить();
			НовыйТовар.Номенклатура = СтрокаСписка.Номенклатура;
			НовыйТовар.ИсходнаяЯчейка = Объект.Ячейка;
			НовыйТовар.ЦелеваяЯчейка = Объект.Ячейка;
		КонецЦикла
	Иначе
	    Сообщить("В ячейке """ + Объект.Ячейка + " нет товара с ненулевым остатком");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНоменклатуруНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьОсновнаяЯчейкаУНоменклатурыНаСервере(Номенклатура, Склад, Ячейка)
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	Возврат ДокументОбъект.ЕстьОсновнаяЯчейкаУНоменклатуры(Номенклатура, Склад, Ячейка);
КонецФункции

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Если ЗначениеЗаполнено(Объект.Ячейка) Тогда
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.ЦелеваяЯчейка = Объект.Ячейка;
			
			Если Режим = "НовыйСклад" Тогда
				НоваяСтрока.Проверено = Истина;
			КонецЕсли;

		Иначе
			Сообщить("Необходимо выбрать ячейку для добавления товара");
		КонецЕсли;
	Иначе
		Сообщить("Необходимо выбрать склад для добавления товара");
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка) Тогда
		Сообщить("Вместо удаления товара """ + Элементы.Товары.ТекущиеДанные.Номенклатура + """" + " из " + Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка + " выберите действие ""Переложить в другую ячейку""");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка) Тогда
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", ВыбранноеЗначение);
		МассивСтрок = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрок.Количество() > 0 Тогда
			Сообщить("Товар """ + ВыбранноеЗначение + """ уже есть в списке");
		Иначе
			Элементы.Товары.ТекущиеДанные.Номенклатура = ВыбранноеЗначение;	
			
			Если ЕстьОсновнаяЯчейкаУНоменклатурыНаСервере(ВыбранноеЗначение, Объект.Склад, Объект.Ячейка) Тогда
				Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка = Объект.Ячейка;
			Иначе
				Элементы.Товары.ТекущиеДанные.Действие = ДействиеПрисвоитьТекущуюЯчейку;
			КонецЕсли;
			
		КонецЕсли;		
	Иначе 
		Сообщить("Выбор номенклатуры доступен для товара не из текущей ячейки");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДоступенВыборДействия(Действие, ИсходнаяЯчейка, Номенклатура, ОбнулитьЦелевуюЯчейку, ТекстСообщения)
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ИсходнаяЯчейка) Тогда
		
		Если Действие = ДействиеПрисвоитьТекущуюЯчейку Тогда
			ТекстСообщения = "Действие ""Присвоить текущую ячейку"" доступно для товара из других ячеек";	
		Иначе
			Результат = Истина;
		КонецЕсли;
		
	Иначе
		
		Если Действие <> ДействиеПрисвоитьТекущуюЯчейку Тогда
			ТекстСообщения = "Для товара из других ячеек доступно только действие ""Присвоить текущую ячейку""";
		Иначе
			Результат = Истина;
		КонецЕсли;
			
	КонецЕсли;
	
	ОбнулитьЦелевуюЯчейку = Ложь;
	Если (Действие = ДействиеПереложитьВДругуюЯчейку) Или (Действие = ДействиеСделатьЯчейкуДополнительной) Тогда
		ОбнулитьЦелевуюЯчейку = Истина;
	КонецЕсли;
	
	Если Действие = ДействиеСделатьЯчейкуДополнительной Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
		ДополнительнаяЯчейка = ДокументОбъект.ПолучитьЯчейкуНоменклатуры(Объект.Склад, Номенклатура, Ложь);
		Если ДополнительнаяЯчейка <> Справочники.СкладскиеЯчейки.ПустаяСсылка() Тогда
			ТекстСообщения = "Номенклатура """ + Номенклатура + """ уже имеет дополнительную ячейку " + ДополнительнаяЯчейка + ". Дополнительная ячейка будет изменена на выбранную фактическую ячейку.";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ТоварыДействиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекстСообщения = "";
	ОбнулитьЦелевуюЯчейку = Ложь;
	Если ДоступенВыборДействия(ВыбранноеЗначение, ДанныеСтрока.ИсходнаяЯчейка, ДанныеСтрока.Номенклатура, ОбнулитьЦелевуюЯчейку, ТекстСообщения) Тогда
		
		Если ДанныеСтрока.Действие <> ВыбранноеЗначение Тогда
			Если ОбнулитьЦелевуюЯчейку Тогда
				ДанныеСтрока.ЦелеваяЯчейка = Неопределено
			Иначе
				ДанныеСтрока.ЦелеваяЯчейка = ДанныеСтрока.ИсходнаяЯчейка; 	
			КонецЕсли;
		КонецЕсли;
		
		ДанныеСтрока.Действие = ВыбранноеЗначение;
		
		Если (ВыбранноеЗначение = ДействиеСделатьЯчейкуДополнительной) И (ТекстСообщения <> "") Тогда		
			Сообщить(ТекстСообщения);	
		КонецЕсли
	Иначе
		Сообщить(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДоступенВыборЦелевойЯчейки(Действие)
	Результат = Ложь;
	Если (Действие = ДействиеПереложитьВДругуюЯчейку) Или  (Действие = ДействиеСделатьЯчейкуДополнительной) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ТоварыЦелеваяЯчейкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ДоступенВыборЦелевойЯчейки(ДанныеСтрока.Действие) Тогда
		ВыбратьЯчейку(Элемент)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦелеваяЯчейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ДоступенВыборЦелевойЯчейки(Элементы.Товары.ТекущиеДанные.Действие) Тогда
		Если ВыбранноеЗначение <> Элементы.Товары.ТекущиеДанные.ИсходнаяЯчейка Тогда
			Элементы.Товары.ТекущиеДанные.ЦелеваяЯчейка = ВыбранноеЗначение;
		Иначе
			Элементы.Товары.ТекущиеДанные.ЦелеваяЯчейка = Неопределено;
			Сообщить("Фактическая ячейка должна отличаться от исходной");		
		КонецЕсли;
	Иначе 
		Сообщить("Выбор фактической ячейки доступен при действиях: " + Символы.ПС + """Переложить в другую ячейку"" и ""Сделать ячейку дополнительной""");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
